# Оригінальний текст
text = """Реве та стогне Дніпр широкий, Сердитий вітер завива. Додолу верби гне високі, 
Горами хвилю підійма. І блідний місяць на ту пору Із хмари де-де виглядав, Неначе човен 
в синім морі, То виринав, то потопав. Ще треті півні не співали, Ніхто ніде не гомонів, 
Сичі в гаю перекликались, Та ясен раз у раз скрипів."""

# Перетворення тексту у нижній регістр
lower_text = text.lower()
print("Текст у нижньому регістрі:")
print(lower_text)

# Замінення коми на пробіл
replace_symbol = text.replace(",", " ")
print("\nТекст без ком:")
print(replace_symbol)

# Кількість слів у тексті
word_count = len(text.split())
print("\nКількість слів у тексті:", word_count)
